InformationRegisters/НастройкаИспользованияШаблонов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>НастройкаИспользованияШаблонов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>УсловиеИспользования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Использовать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИдентификаторДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Шаблон</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШаблоныПроцессов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/НастройкаИспользованияШаблонов/Forms/НастройкаИспользованияШаблонов/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьСписок();
	
	УстановитьТекущуюСтроку(Параметры.Шаблон, Параметры.ИдентификаторДокумента);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "ЗаписьНастройкиИспользованияШаблона" Тогда
		
		ТекущийШаблон = Неопределено;
		ТекущийИдентификаторДокумента = Неопределено;
		ТекущиеДанные = Элементы.Список.ТекущиеДанные;
		Если ТекущиеДанные <> Неопределено Тогда
			ТекущийШаблон = ТекущиеДанные.Шаблон;
			ТекущийИдентификаторДокумента = ТекущиеДанные.ИдентификаторДокумента;
		КонецЕсли;
			
		ЗаполнитьСписок();
		УстановитьТекущуюСтроку(ТекущийШаблон, ТекущийИдентификаторДокумента);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокПредставлениеУсловияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	
	Если ЗначениеЗаполнено(ТекущиеДанные.Шаблон) Тогда
		ПараметрыФормы = Новый Структура("ИдентификаторДокумента, НастройкиОтбора, ЗаголовокОкна, ВидНастройкиФункцийУсловий",
			ТекущиеДанные.ИдентификаторДокумента,
			ТекущиеДанные.УсловиеИспользования,
			НСтр("ru = 'Установка условия использования шаблона'"),
			"НастройкиИспользования");
		ОткрытьФорму("ОбщаяФорма.НастройкаОтбора", ПараметрыФормы, Элементы.Список);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено Тогда
		
		ТекущиеДанные.УсловиеИспользования = ВыбранноеЗначение.НастройкиОтбора;
		ТекущиеДанные.ПредставлениеУсловия = ВыбранноеЗначение.ПредставлениеОтбора;
		
		ЗаписатьПроцессПоОбъекту(ТекущиеДанные.ИдентификаторДокумента, ТекущиеДанные.Шаблон, ТекущиеДанные.УсловиеИспользования);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПредставлениеУсловияОчистка(Элемент, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	ТекущиеДанные.УсловиеИспользования = "";
	
	ЗаписатьПроцессПоОбъекту(ТекущиеДанные.ИдентификаторДокумента, ТекущиеДанные.Шаблон, ТекущиеДанные.УсловиеИспользования);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено И Элемент.ТекущиеДанные.КоличествоШаблоновИдентификатора > 1 Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ФормаУдалить", "Доступность", Истина);
	Иначе
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ФормаУдалить", "Доступность", Ложь);
	КонецЕсли;
	
	Если ТекущиеДанные <> Неопределено И ЗначениеЗаполнено(Элемент.ТекущиеДанные.Шаблон) Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ФормаДобавить", "Доступность", Истина);
	Иначе
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ФормаДобавить", "Доступность", Ложь);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокШаблонОчистка(Элемент, СтандартнаяОбработка)
	
	ОчиститьШаблон(Элементы.Список.ТекущиеДанные, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокШаблонОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	ПерезаписатьПроцессПоОбъекту(ТекущиеДанные.ИдентификаторДокумента, ТекущиеДанные.Шаблон, ТекущиеДанные.УсловиеИспользования, ВыбранноеЗначение);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Обновить(Команда)
	
	ТекущийШаблон = Неопределено;
	ТекущийИдентификаторДокумента = Неопределено;
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		ТекущийШаблон = ТекущиеДанные.Шаблон;
		ТекущийИдентификаторДокумента = ТекущиеДанные.ИдентификаторДокумента;
	КонецЕсли;
		
	ЗаполнитьСписок();
	УстановитьТекущуюСтроку(ТекущийШаблон,ТекущийИдентификаторДокумента);
	
КонецПроцедуры

&НаКлиенте
Процедура Добавить(Команда)
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	
	ПараметрыФормы = Новый Структура("ИдентификаторДокумента", ТекущиеДанные.ИдентификаторДокумента);
	ОткрытьФорму("РегистрСведений.НастройкаИспользованияШаблонов.Форма.ФормаЗаписи", ПараметрыФормы, ЭтотОбъект, ЭтотОбъект.УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура Удалить(Команда)
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено Тогда
		
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("ИдентификаторДокумента", ТекущиеДанные.ИдентификаторДокумента);
		ДополнительныеПараметры.Вставить("Шаблон", ТекущиеДанные.Шаблон);
		
		ПоказатьВопрос(Новый ОписаниеОповещения("СписокПередУдалениемЗавершение", ЭтотОбъект, ДополнительныеПараметры),
			НСтр("ru = 'Удалить запись?'"),
			РежимДиалогаВопрос.ДаНет, ,КодВозвратаДиалога.Да);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОчиститьШаблон(ТекущиеДанные, СтандартнаяОбработка)
	
	Если ТекущиеДанные.КоличествоШаблоновИдентификатора > 1 Тогда
		
		СтандартнаяОбработка = Ложь;
		
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("ИдентификаторДокумента", ТекущиеДанные.ИдентификаторДокумента);
		ДополнительныеПараметры.Вставить("Шаблон", ТекущиеДанные.Шаблон);
		
		ПоказатьВопрос(Новый ОписаниеОповещения("СписокПередУдалениемЗавершение", ЭтотОбъект, ДополнительныеПараметры),
			НСтр("ru = 'Удалить запись?'"),
			РежимДиалогаВопрос.ДаНет, ,КодВозвратаДиалога.Да);
		
	Иначе
		
		// Следует удалить запись с шаблоном и записать пустой вместо него
		ПерезаписатьПроцессПоОбъекту(ТекущиеДанные.ИдентификаторДокумента, ТекущиеДанные.Шаблон);
		ТекущиеДанные.УсловиеИспользования = "";
		ТекущиеДанные.ПредставлениеУсловия = "";
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПередУдалениемЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		УдалитьЗаписьРегистраПоИзмерениям(ДополнительныеПараметры);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура УдалитьЗаписьРегистраПоИзмерениям(ДополнительныеПараметры)
	
	МенеджерЗаписи = РегистрыСведений.НастройкаИспользованияШаблонов.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.ИдентификаторДокумента = ДополнительныеПараметры.ИдентификаторДокумента;
	МенеджерЗаписи.Шаблон = ДополнительныеПараметры.Шаблон;
	МенеджерЗаписи.Удалить();
	
	ЗаполнитьСписок();
	УстановитьТекущуюСтроку(Неопределено, ДополнительныеПараметры.ИдентификаторДокумента);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписок()
	
	ПроцессыДокументов = ТекущиеПроцессыДокументов();
	
	ТаблицаНастроек = РеквизитФормыВЗначение("Список");
	ТаблицаНастроек.Очистить();
	
	МассивОтсутствующихИдентификаторов = Новый Массив;
	
	Для Каждого Тип Из Метаданные.ОпределяемыеТипы.ПредметПроцессаОбработкиДокументов.Тип.Типы() Цикл
		
		МетаданныеОбъекта = Метаданные.НайтиПоТипу(Тип);
		ИдентификаторДокумента = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(Тип);
		СинонимНаименованияОбъекта = МетаданныеОбъекта.Синоним;
		
		НайденныеПроцессы = ПроцессыДокументов.НайтиСтроки(Новый Структура("ИдентификаторДокумента", ИдентификаторДокумента));
		Если НайденныеПроцессы.Количество() > 0 Тогда
			Для Каждого НайденныйПроцесс Из НайденныеПроцессы Цикл
				НоваяСтрокаТаблицы = ТаблицаНастроек.Добавить();
				НоваяСтрокаТаблицы.ИдентификаторДокумента = ИдентификаторДокумента;
				НоваяСтрокаТаблицы.СинонимНаименованияОбъекта = СинонимНаименованияОбъекта;
				НоваяСтрокаТаблицы.Шаблон = НайденныйПроцесс.Шаблон;
				НоваяСтрокаТаблицы.УсловиеИспользования = НайденныйПроцесс.УсловиеИспользования;
				НоваяСтрокаТаблицы.ПредставлениеУсловия = ПроцессыОбработкиДокументов.ПредставлениеОтбораКомпоновщикаНастроек(НайденныйПроцесс.УсловиеИспользования);
				НоваяСтрокаТаблицы.КоличествоШаблоновИдентификатора = НайденныеПроцессы.Количество();
				НайденныйПроцесс.НайденТип = Истина;
			КонецЦикла;
		Иначе
			НоваяСтрокаТаблицы = ТаблицаНастроек.Добавить();
			НоваяСтрокаТаблицы.ИдентификаторДокумента = ИдентификаторДокумента;
			НоваяСтрокаТаблицы.СинонимНаименованияОбъекта = СинонимНаименованияОбъекта;
			МассивОтсутствующихИдентификаторов.Добавить(НоваяСтрокаТаблицы.ИдентификаторДокумента);
		КонецЕсли;
		
	КонецЦикла;
	
	Если МассивОтсутствующихИдентификаторов.Количество() > 0 Тогда
		НаборЗаписей = РегистрыСведений.НастройкаИспользованияШаблонов.СоздатьНаборЗаписей();
		Для Каждого ОтсутствующийИдентификатор Из МассивОтсутствующихИдентификаторов Цикл
			Запись = НаборЗаписей.Добавить();
			Запись.ИдентификаторДокумента = ОтсутствующийИдентификатор;
		КонецЦикла;
		НаборЗаписей.Записать(Ложь);
	КонецЕсли;
	
	Для Каждого СтрокаПроцесса Из ПроцессыДокументов Цикл
		Если НЕ СтрокаПроцесса.НайденТип Тогда
			НаборЗаписей = РегистрыСведений.НастройкаИспользованияШаблонов.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.ИдентификаторДокумента.Установить(СтрокаПроцесса.ИдентификаторДокумента);
			НаборЗаписей.Записать();
		КонецЕсли;
	КонецЦикла;
	
	ТаблицаНастроек.Сортировать("СинонимНаименованияОбъекта");
	
	ЗначениеВРеквизитФормы(ТаблицаНастроек, "Список");
	
КонецПроцедуры

&НаСервере
Функция ТекущиеПроцессыДокументов()
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	НастройкаИспользованияШаблонов.ИдентификаторДокумента КАК ИдентификаторДокумента,
	|	НастройкаИспользованияШаблонов.Шаблон КАК Шаблон,
	|	НастройкаИспользованияШаблонов.УсловиеИспользования КАК УсловиеИспользования,
	|	ЛОЖЬ КАК НайденТип
	|ИЗ
	|	РегистрСведений.НастройкаИспользованияШаблонов КАК НастройкаИспользованияШаблонов";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

&НаСервереБезКонтекста
Процедура ЗаписатьПроцессПоОбъекту(Знач ТипОбъекта, Знач Шаблон, Знач УсловиеИспользования)
	
	Если ТипЗнч(ТипОбъекта) <> Тип("СправочникСсылка.ИдентификаторыОбъектовМетаданных") Тогда
		ТипОбъекта = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(ТипОбъекта);
	КонецЕсли;
	
	МенеджерЗаписи = РегистрыСведений.НастройкаИспользованияШаблонов.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.ИдентификаторДокумента = ТипОбъекта;
	МенеджерЗаписи.Шаблон = Шаблон;
	МенеджерЗаписи.УсловиеИспользования = УсловиеИспользования;
	МенеджерЗаписи.Записать();
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПерезаписатьПроцессПоОбъекту(Знач ТипОбъекта, Знач Шаблон, Знач УсловиеИспользования = "", Знач ШаблонНовый = Неопределено)
	
	Если ТипЗнч(ТипОбъекта) <> Тип("СправочникСсылка.ИдентификаторыОбъектовМетаданных") Тогда
		ТипОбъекта = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(ТипОбъекта);
	КонецЕсли;
	
	НачатьТранзакцию();
	Попытка
		МенеджерЗаписи = РегистрыСведений.НастройкаИспользованияШаблонов.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.ИдентификаторДокумента = ТипОбъекта;
		МенеджерЗаписи.Шаблон = Шаблон;
		МенеджерЗаписи.Удалить();
		
		МенеджерЗаписи.ИдентификаторДокумента = ТипОбъекта;
		Если ШаблонНовый = Неопределено Тогда
			МенеджерЗаписи.Шаблон = ПредопределенноеЗначение("Справочник.ШаблоныПроцессов.ПустаяСсылка");
			МенеджерЗаписи.УсловиеИспользования = "";
		Иначе
			МенеджерЗаписи.Шаблон = ШаблонНовый;
			МенеджерЗаписи.УсловиеИспользования = УсловиеИспользования;
		КонецЕсли;
		МенеджерЗаписи.Записать(Ложь);
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Запись процесса документа'", ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()),
									УровеньЖурналаРегистрации.Ошибка,
									,
									,
									ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ВызватьИсключение;
	КонецПопытки
	
КонецПроцедуры

&НаСервере
Процедура УстановитьТекущуюСтроку(Шаблон = Неопределено, ИдентификаторДокумента = Неопределено)
	
	ПараметрыПоиска = Новый Структура();
	
	Если ЗначениеЗаполнено(Шаблон) Тогда
		ПараметрыПоиска.Вставить("Шаблон", Шаблон);
		НайденныеСтроки = Список.НайтиСтроки(ПараметрыПоиска);
		
		Если НайденныеСтроки.Количество() = 0 Тогда
			Если ЗначениеЗаполнено(ИдентификаторДокумента) Тогда
				ПараметрыПоиска.Очистить();
				ПараметрыПоиска.Вставить("ИдентификаторДокумента", ИдентификаторДокумента);
				НайденныеСтроки = Список.НайтиСтроки(ПараметрыПоиска);
				УстановитьТекущуюСтрокуПоНайденным(НайденныеСтроки);
			КонецЕсли;
		Иначе
			УстановитьТекущуюСтрокуПоНайденным(НайденныеСтроки);
		КонецЕсли;
	ИначеЕсли ЗначениеЗаполнено(ИдентификаторДокумента) Тогда
		ПараметрыПоиска.Вставить("ИдентификаторДокумента", ИдентификаторДокумента);
		НайденныеСтроки = Список.НайтиСтроки(ПараметрыПоиска);
		УстановитьТекущуюСтрокуПоНайденным(НайденныеСтроки)
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьТекущуюСтрокуПоНайденным(НайденныеСтроки)
	
	Если НайденныеСтроки.Количество() > 0 Тогда
		Элементы.Список.ТекущаяСтрока = НайденныеСтроки[0].ПолучитьИдентификатор();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
